//#include<stdio.h>
//
///*给定整数 n，获取所有小于等于 n 的质数的数量 。
//示例:输入:n = 100 输出:25
//质数:只能被1和本身整除的数字
//*/
//int main() {
//	int number = 100;
//	int count = 0;
//	for (int i = 2; i <= number; i++) {
//		//质数不包含1！
//		//定义i在2-100（范围里面一个个找有几个质数)
//
//		int total = 0;//定义可重置计数器total来统计判断是否为质数
//		for (int j = 2; j < i; j++) {
//			//j < i就找能否被其他数字整除
//			//因为所有数字都可以被1和自己整除
//			if (i % j == 0) {
//				total++;//统计能否其他数字整除
//				break;
//			}
//
//		}
//		if (total == 0) {
//			//如果total为0 则就是2到i-1里面没有能被其他数字整除的，也就是质数
//			
//			//printf("整数%d是一个质数\n", i);
//			count++;
//		}
//		
//	}
//	printf("在整数%d中，质数有%d个", number, count);
//
//
//
//
//	return 0;
//}