//#include<stdio.h>
//
//
//int main() 
//{//
//	//数组 = arr[索引] = {元素};		元素数量 <= 索引
//
//	int arr1[] = { 3,5,7 };//[]内可不写，数组数量={}内的数量
//	int arr2[3] = { 2,4,6 };//[]内的数量不能小于{}内的数量
//
//	int num = arr1[0];//索引0是{}内第一个数字，以此类推
//	int num2 = arr2[2];//索引2是第三个数字，即为6
//	int sum = num + num2;
//	printf("%d\n", num);
//	printf("%d\n", num2);
//	printf("%d\n", sum);
//
//	printf("修改前%d\n", arr1[1]);
//	arr1[1] = 20;//赋值修改元素
//	printf("修改后%d\n", arr1[1]);
//
//
//
//
//	int a = 10;//内存地址(指针)%p
//	printf("%p\n", & a);
//
//	int b = 10;
//	printf("%p\n", &b );
//
//
//
//
//
//
//	int arr[] = { 1,2,3 };
//	printf("%p\n", &arr);//数组首地址
//	printf("%p\n", &arr[0]);//数组首地址
//	printf("%p\n", &arr[1]);//从内存角度看，是首地址+偏移量
//	printf("%p\n", &arr[2]);
//	//printf("%p\n", &arr[3]);//数组之外的内存地址，没有实际分配的空间
//	/*C 语言没有数组边界检查，因此它允许这种地址的计算
//	但是如果访问或使用这个地址，程序可能会产生不可预料的结果(崩溃)*/
//
//	return 0;
//}