//#include<stdio.h>
//
///*
//	二维数组
//	利用指针遍历二维数组
//*/
//
//
//
//int main() {
//
//	//定义一个二维数组
//	int arr[3][5] =
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},
//		{111,222,333,444,555}	
//	};
//	int (*p)[5] = arr;//p定义指向为arr[0]
//	//printf("%p\n", arr);//打印二维数组的首地址(指针)
//	//printf("%p\n", arr + 1);//打印二维数组的下一个数组地址(指针)
//
//	for (int i = 0; i < 3; i++) {
//
//		//遍历一维数组
//		for (int j = 0; j < 5; j++) {
//			printf("%d ", *(*p + j));
//			//内部解引了是二维数组解引成一维数组的指针,j是偏移量,
//			//所以整个的基础上要再在外部解引一次变成整数
//		}
//		printf("\n");
//		p++;//移动二维数组的指针,继续遍历下一个一维数组
//	}
//
//
//
//	return 0;
//}
//
