//#include<stdio.h>
//
///*
//	二维数组
//		定义格式和遍历方式
//
//		定义格式方式一
//			m：表示二维数组的长度
//			n：表示每一个一维数组的长度
//			数据类型arr[m][n]=
//			{
//				{1,2,3,4,5....},
//				{1,2,3,4,5....},
//				{1,2,3,4,5....}
//			};
//		遍历：利用索引遍历/利用数组遍历
//*/
//
//void show(int arr[][5], int rows);
//int main() {
//	//定义一个二维数组
//	int arr[3][5] =
//		//arr[行数][列数]
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},
//		{111,222,333,444,555}
//
//	};
//
//	show(arr, 3);//这里的3是赋值给rows
//
//	return 0;
//}
//void show(int arr[][5], int rows)
///*定义中arr数组在编译的时候由
//	int arr[3][5] ={{1,2,3,4,5},...（省略）};
//
//	已经得知一维数组的具体大小，所以arr[]第一个（行数）可以为空
//	列数需要指定，以便函数可以正确访问到元素
//
//*/
//{
//	for (int i = 0; i < rows; i++) {
//		for (int j = 0; j < 5; j++) {
//			printf("%d ", arr[i][j]);
//		}
//		printf("内循环第%d次结束\n", i + 1);
//	}
//
//}